<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/2_Date_Time/3_Date_Differences.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Date & Time Differences

## Overview

### ü•Ö Analysis Goals

- **Analyze processing times**: Calculate the time difference between order dates and delivery dates to evaluate operational efficiency.  
- **Aggregate and summarize sales**: Group sales data by year to identify trends and patterns in revenue and processing times.

### üìò Concepts Covered

- `INTERVAL`
- `AGE()`

[Source Documentation on Date/Time Functions.](https://www.postgresql.org/docs/current/functions-datetime.html)

---

In [2]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## INTERVAL

### üìù¬†Notes

`INTERVAL`

- **INTERVAL** represents a span of time, such as days, months, hours, or seconds.
- Commonly used for date arithmetic (e.g., `CURRENT_DATE + INTERVAL '1 month'` adds one month to the current date).

- Syntax:
    ```sql
    SELECT INTERVAL 'value unit'
    ```
- Units:
    - years
    - months 
    - days
    - hours
    - minutes
    - seconds
    - microseconds
    - millenniums
    - centuries
    - decades
    - weeks
    - quarters

In [33]:
%%sql

SELECT INTERVAL '5 years'

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   interval
0 1825 days

In [2_Date_Filtering.ipynb](2_Date_Filtering.ipynb), based on our knowledge we had to use this verbose language to get dates in the last 5 years.

In [22]:
%%sql

SELECT 
	CURRENT_DATE,
	orderdate
FROM sales
WHERE
	EXTRACT(YEAR FROM orderdate) >= EXTRACT(YEAR FROM CURRENT_DATE) - 5  -- last 5 years

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

124451 rows affected.

       current_date   orderdate
0        2025-02-14  2020-01-01
1        2025-02-14  2020-01-01
2        2025-02-14  2020-01-01
3        2025-02-14  2020-01-01
4        2025-02-14  2020-01-01
...             ...         ...
124446   2025-02-14  2024-04-20
124447   2025-02-14  2024-04-20
124448   2025-02-14  2024-04-20
124449   2025-02-14  2024-04-20
124450   2025-02-14  2024-04-20

[124451 rows x 2 columns]

Now we can write it more succient and get it to the date of exactly 5 years, with `INTERVAL`.

In [23]:
%%sql

SELECT 
	CURRENT_DATE,
	orderdate
FROM sales
WHERE
	orderdate >= CURRENT_DATE - INTERVAL '5 years' -- Added

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

121325 rows affected.

       current_date   orderdate
0        2025-02-14  2020-02-14
1        2025-02-14  2020-02-14
2        2025-02-14  2020-02-14
3        2025-02-14  2020-02-14
4        2025-02-14  2020-02-14
...             ...         ...
121320   2025-02-14  2024-04-20
121321   2025-02-14  2024-04-20
121322   2025-02-14  2024-04-20
121323   2025-02-14  2024-04-20
121324   2025-02-14  2024-04-20

[121325 rows x 2 columns]

### üìà Analysis

- Limit results to the last 5 years of sales, excluding the current year. Which makes the query's date filter dynamically update (instead of having to manually update it).

#### Filter Data by Time Intervals

0. Starting query from last lesson on [2_Date_Filtering.ipynb](2_Date_Filtering.ipynb).

In [24]:
%%sql

SELECT 
	CURRENT_DATE,
	s.orderdate,
	p.categoryname, 
	SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM sales s
	LEFT JOIN product p ON s.productkey = p.productkey
WHERE
	EXTRACT(YEAR FROM s.orderdate) >= EXTRACT(YEAR FROM CURRENT_DATE) - 5  -- last 5 years
GROUP BY
	s.orderdate,
	p.categoryname
ORDER BY
	s.orderdate,
	p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

11171 rows affected.

      current_date   orderdate                   categoryname  net_revenue
0       2025-02-14  2020-01-01                          Audio      5490.14
1       2025-02-14  2020-01-01        Cameras and camcorders      18880.06
2       2025-02-14  2020-01-01                    Cell phones     22593.00
3       2025-02-14  2020-01-01                      Computers     78554.54
4       2025-02-14  2020-01-01                 Games and Toys      1476.43
...            ...         ...                            ...          ...
11166   2025-02-14  2024-04-20                      Computers     58353.68
11167   2025-02-14  2024-04-20                 Games and Toys      1744.30
11168   2025-02-14  2024-04-20                Home Appliances      1562.04
11169   2025-02-14  2024-04-20  Music, Movies and Audio Books      4949.43
11170   2025-02-14  2024-04-20                   TV and Video      9841.91

[11171 rows x 4 columns]

**`INTERVAL`** and **`CURRENT_DATE`**

1. Use the last query to only return orders within the last 5 years of the current date.
    - Use `CURRENT_DATE` to dynamically reference the current date.
    - Subtract `INTERVAL '5 years'` from `CURRENT_DATE` to calculate the start date for filtering.
    - Add a `WHERE` clause to include only rows where `orderdate` is greater than or equal to the calculated start date.

In [25]:
%%sql

SELECT 
	s.orderdate,
    p.categoryname, 
	SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM sales s
	LEFT JOIN product p ON s.productkey = p.productkey
WHERE
	s.orderdate >= CURRENT_DATE - INTERVAL '5 years' -- Added
GROUP BY
	s.orderdate,
    p.categoryname
ORDER BY
	s.orderdate,
    p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10836 rows affected.

        orderdate                   categoryname  net_revenue
0      2020-02-14                          Audio       893.92
1      2020-02-14        Cameras and camcorders      12265.49
2      2020-02-14                    Cell phones     15050.12
3      2020-02-14                      Computers     37146.48
4      2020-02-14                 Games and Toys       705.07
...           ...                            ...          ...
10831  2024-04-20                      Computers     58353.68
10832  2024-04-20                 Games and Toys      1744.30
10833  2024-04-20                Home Appliances      1562.04
10834  2024-04-20  Music, Movies and Audio Books      4949.43
10835  2024-04-20                   TV and Video      9841.91

[10836 rows x 3 columns]

<img src="../Resources/images/2.3_year_rev_category_filtered.
png" alt="Rev & Category" width="50%">  

**NOTE:** The 2020 values shown here only include those dates withing the past 5 years.

---
## AGE

### üìù¬†Notes

`AGE()`
- `AGE` calculates the difference between two dates and returns the result as an interval.  

- Syntax:
    ```sql
    AGE(end_date, start_date)
    ```

In [26]:
%%sql

SELECT AGE('2024-01-08', '2024-01-01')

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

     age
0 7 days

Reminder:
- `EXTRACT` retrieves a specific component (e.g., day, month, year) from a timestamp or interval.

- Syntax:
    ```sql
    EXTRACT(unit FROM source)
    ```

In [27]:
%%sql

SELECT EXTRACT(DAY FROM AGE('2024-01-08', '2024-01-01'));

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

  extract
0       7

### üìà Analysis

- Evaluate operational performance by calculating the average time taken between order and delivery dates.  
- Aggregate data by time intervals (month, year) to provide actionable insights into revenue and efficiency.

#### Calculate Processing Time

**`AGE`**

1. Calculate the difference in time between the delivery date and order date using `AGE`.
    - Use `AGE(deliverydate, orderdate)` to compute the processing time for each order.
    - Return the order date, processing time, and delivery date for each transaction.

In [3]:
%%sql

SELECT
    orderdate,
    deliverydate,
    AGE(deliverydate, orderdate) AS processing_time
FROM
    sales
ORDER BY RANDOM()
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

    orderdate deliverydate processing_time
0  2021-05-07   2021-05-07          0 days
1  2024-04-19   2024-04-24          5 days
2  2016-05-11   2016-05-11          0 days
3  2023-08-15   2023-08-15          0 days
4  2018-04-04   2018-04-04          0 days
5  2018-11-21   2018-11-26          5 days
6  2024-04-09   2024-04-12          3 days
7  2022-09-09   2022-09-09          0 days
8  2019-12-24   2019-12-24          0 days
9  2021-12-25   2021-12-25          0 days

2. Get the year from the `orderdate` using `DATE_PART` and use calculate the average processing time using `AVG` and `EXTRACT` on the `AGE` to get the time between the deliver date and order date in days. 
    - üîî Return the year from the `orderdate` using `DATE_PART('year', orderdate)`.
    - üîî Use `AVG` and `EXTRACT` on `AGE(deliverydate, orderdate)` to compute the average processing time in days for each order: `AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate)))`

In [6]:
%%sql

SELECT
    DATE_PART('year', orderdate) AS order_year,
    AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate))) AS avg_processing_time
FROM
    sales 
GROUP BY
    order_year;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   order_year     avg_processing_time
0     2019.00  0.81467910282034199423
1     2016.00      1.0828877005347594
2     2017.00  0.83310293982121463460
3     2018.00  0.86241686648871193956
4     2022.00      1.6233962099189089
5     2015.00      1.0982768691588785
6     2020.00  0.92988373125055471732
7     2021.00      1.3570381602223907
8     2023.00      1.7526721219713730
9     2024.00  1.66696278748396012240

3. Round the average processing time to two decimal places using `ROUND` and only get data from the last 5 years. 
    - Return the year from the `orderdate` using `DATE_PART('year', orderdate)`.
    - Use `AVG` and `EXTRACT` on `AGE(deliverydate, orderdate)` to compute the average processing time in days for each order: `AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate)))`
    - üîî Only return data for the last 5 years using `orderdate >= CURRENT_DATE - INTERVAL '5 years'`.
    - üîî Use `ROUND()` to format the average processing time and total sales to two decimal places.
    - `ROUND`: Rounds numeric values to a specified number of decimal places for better readability.
         - Syntax:
             ```sql
             ROUND(value, precision)
             ```
         - Example:
             ```sql
             SELECT ROUND(1234.56789, 2);
             ```

In [7]:
%%sql

SELECT
    DATE_PART('year', orderdate) AS order_year,
    ROUND(AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate))), 2) AS avg_processing_time
FROM
    sales 
WHERE 
    orderdate >= CURRENT_DATE - INTERVAL '5 years'
GROUP BY
    order_year;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

   order_year avg_processing_time
0     2022.00                1.62
1     2020.00                0.96
2     2021.00                1.36
3     2023.00                1.75
4     2024.00                1.67

4. Calculate `order_month`, `net_revenue`, and then groupby the `order_month`:
    - Return the year from the `orderdate` using `DATE_PART('year', orderdate)`.
    - Use `ROUND()` to format the average processing time and total revenue to two decimal places.
    - Use `AVG` and `EXTRACT` on `AGE(deliverydate, orderdate)` to compute the average processing time in days for each order: `AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate)))`
    - Only return data for the last 5 years using `orderdate >= CURRENT_DATE - INTERVAL '5 years'`.
    - üîî Compute the total net revenue using `SUM(quantity * netprice * exchangerate)`.
    - üîî Use `CAST()` as an integer format the total revenue to 0 decimal places.
     - `CAST`: Converts a value from one data type to another
         - Syntax:
             ```sql
             CAST(expression AS datatype)
             ```
         - Example:
             ```sql
             SELECT CAST(123.45 AS INTEGER);
             ```

In [10]:
%%sql

SELECT
    DATE_PART('year', orderdate) AS order_year,
    ROUND(AVG(EXTRACT(DAYS FROM AGE(deliverydate, orderdate))), 2) AS avg_processing_time,
    CAST(SUM(quantity * netprice * exchangerate) AS INTEGER) AS net_revenue  -- Added
FROM 
    sales s
WHERE 
    orderdate >= CURRENT_DATE - INTERVAL '5 years'
GROUP BY 
    order_year
ORDER BY 
    order_year;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

   order_year avg_processing_time  net_revenue
0     2020.00                0.96      6124259
1     2021.00                1.36     21357977
2     2022.00                1.62     44864557
3     2023.00                1.75     33108566
4     2024.00                1.67      8396527

<img src="../Resources/images/2.3_yearly_processing_rev.png" alt="Processing & Revenue" width="50%">